test/config.yml
config:
    target: "http://localhost:3000"
    phases:
        - duration: 60 # in seconds
          arrivalRate: 5
          name: Warm up
        - duration: 120
          arrivalRate: 5
          rampTo: 50
          name: Ramp up load
        - duration: 300
          arrivalRate: 50
          name: Sustained load
scenarios:
    - name: Save and Count Logs
      flow:
          - get:
                url: "/logs/count"
          - think: 2
          - post:
                url: "/logs"
          - think: 5
          - get:
                url: "/logs/count"